zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_gap_aci.h
/**
  ******************************************************************************
  * @file    stm32wb07_06_gap_aci.h
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version 1.0.0
  * @date    04-March-2025
  * @brief   Header file for external uC - stm32wb07_06 in network coprocessor
  *          mode (gap_aci). Autogenerated files, do not edit!!
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#ifndef _STM32WB07_06_GAP_ACI_H_
#define _STM32WB07_06_GAP_ACI_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32wb07_06_types.h"
#include "stm32wb07_06_hci_le.h"

/** Documentation for C struct bonded_device_entry_t */
typedef struct bonded_device_entry_t_s
{
  /** Address type.
    *  Values:
    *  - 0x00: Public Device Address
    *  - 0x01: Random Device Address
    */
  uint8_t address_type;
  /** Identity Address (Public or Random) of the device.
   */
  uint8_t address[6];
} bonded_device_entry_t;

/** Documentation for C struct list_entry_t */
typedef struct list_entry_t_s
{
  /** Address type.
    *  Values:
    *  - 0x00: Public Device Address
    *  - 0x01: Random Device Address
    */
  uint8_t peer_address_type;
  /** Public Device Address or Random Device Address of the device to be added to the
    *  list.
    */
  uint8_t peer_address[6];
} list_entry_t;
/**
  * @brief Set the IO capabilities of the device. This command cannot be sent
  *        during a pairing procedure.
  * @param io_capability IO capability of the device.
  *        Values:
  *        - 0x00: IO_CAP_DISPLAY_ONLY
  *        - 0x01: IO_CAP_DISPLAY_YES_NO
  *        - 0x02: IO_CAP_KEYBOARD_ONLY
  *        - 0x03: IO_CAP_NO_INPUT_NO_OUTPUT
  *        - 0x04: IO_CAP_KEYBOARD_DISPLAY
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_io_capability(uint8_t io_capability);
/**
  * @brief Set the authentication requirements for the device. If the command is
  *        given during pairing, the command returns  BLE_STATUS_NOT_ALLOWED.
  * @param bonding_mode Bonding mode. Only if bonding is enabled (0x01), the
  *        bonding information is stored in flash
  *        Values:
  *        - 0x00: NO_BONDING
  *        - 0x01: BONDING
  * @param mitm_mode MITM mode.
  *        Values:
  *        - 0x00: MITM_PROTECTION_NOT_REQUIRED
  *        - 0x01: MITM_PROTECTION_REQUIRED
  * @param sc_support LE Secure connections support. - 0x00: Secure Connections
  *        Pairing not supported - 0x01: Secure Connections Pairing supported but
  *        optional - 0x02: Secure Connections Pairing supported and mandatory
  *        (SC Only Mode)
  *        Values:
  *        - 0x00: SC_IS_NOT_SUPPORTED
  *        - 0x01: SC_IS_SUPPORTED
  *        - 0x02: SC_IS_MANDATORY
  * @param key_press_notification_support Keypress notification support
  *        Values:
  *        - 0x00: KEYPRESS_IS_NOT_SUPPORTED
  *        - 0x01: KEYPRESS_IS_SUPPORTED
  * @param min_encryption_key_size Minimum encryption key size to be used during
  *        pairing
  *        Values:
  *        - 7 ... 16
  * @param max_encryption_key_size Maximum encryption key size to be used during
  *        pairing
  *        Values:
  *        - 7 ... 16
  * @param use_fixed_pin Use or not fixed pin. If set to 0x00, then during the
  *        pairing process the application will not be requested for a pin
  *        (fixed_pin will be used). If set to 0x01, then during pairing process
  *        if a passkey is required the application will be notified
  *        Values:
  *        - 0x00: USE_FIXED_PIN_FOR_PAIRING
  *        - 0x01: DONOT_USE_FIXED_PIN_FOR_PAIRING
  * @param fixed_pin Fixed pin to be used during pairing if MIMT protection is
  *        enabled. Any random value between 0 to 999999
  *        Values:
  *        - 0 ... 999999
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_authentication_requirement(uint8_t bonding_mode,
                                                    uint8_t mitm_mode,
                                                    uint8_t sc_support,
                                                    uint8_t key_press_notification_support,
                                                    uint8_t min_encryption_key_size,
                                                    uint8_t max_encryption_key_size,
                                                    uint8_t use_fixed_pin,
                                                    uint32_t fixed_pin);
/**
  * @brief Set the authorization requirements of the device. This command has to
  *        be given when connected to a device if authorization is required to
  *        access services which require authorization. DEPRECATED API (still
  *        supported but not recommended)
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param authorization_enable Enable the authorization in the device and when a
  *        remote device tries to read/write a characteristic with authorization
  *        requirements, the stack will send back an error response with
  *        "Insufficient authorization" error code. After pairing is complete a
  *        ACI_GAP_AUTHORIZATION_REQ_EVENT will be sent to the Host.
  *        Values:
  *        - 0x00: AUTHORIZATION_NOT_REQUIRED
  *        - 0x01: AUTHORIZATION_REQUIRED
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_authorization_requirement(uint16_t connection_handle,
                                                   uint8_t authorization_enable);
/**
  * @brief This command should be send by the host in response to @ref
  *        aci_gap_pass_key_req_event event. The command parameter contains the
  *        pass key which will be used during the pairing process.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param pass_key Pass key that will be used during the pairing process.  Must
  *        be a six-digit decimal number.
  *        Values:
  *        - 0 ... 999999
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_pass_key_resp(uint16_t connection_handle,
                                   uint32_t pass_key);
/**
  * @brief Authorize a device to access attributes. This command should be send
  *        by the host in response to @ref aci_gap_authorization_req_event event.
  *        DEPRECATED API (still supported but not recommended)
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param authorize Authorization response.
  *        Values:
  *        - 0x01: Authorize
  *        - 0x02: Reject
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_authorization_resp(uint16_t connection_handle,
                                        uint8_t authorize);
/**
  * @brief Initialize the GAP layer. Register the GAP service with the GATT.
  *        Depending on the role, presence of standard GAP characteristics will
  *        be checked (Device Name, Appearance, Peripheral Preferred Connection
  *        Parameters).  WARNING: A section of the Flash memory is used by this
  *        procedure. When this section is empty, data are written inside. This
  *        normally happens once during the lifetime of the device, when the
  *        command is executed for the first time (unless the section is erased).
  *        Do not power off the device while this function is writing into Flash
  *        memory.
  * @param role Bitmap of allowed roles.
  *        Flags:
  *        - 0x01: Peripheral
  *        - 0x02: Broadcaster
  *        - 0x04: Central
  *        - 0x08: Observer
  * @param privacy_type Specify if privacy is enabled or not and which one .
  *        Values:
  *        - 0x00: Privacy disabled
  *        - 0x01: Privacy host enabled
  *        - 0x02: Privacy controller enabled
  * @param device_name_char_len Length of the device name characteristic
  *        Values:
  *        - 0 ... 248
  * @param identity_address_type Specify which address has to be used as Identity
  *        Address. 0x00: The public address is used as identity address 0x01:
  *        The static random address is used as identity address
  *        Values:
  *        - 0x00: Public Address
  *        - 0x01: Static Random Address
  * @param[out] service_handle Handle of the GAP service
  * @param[out] dev_name_char_handle Device Name Characteristic handle
  * @param[out] appearance_char_handle Appearance Characteristic handle
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_init(uint8_t role,
                          uint8_t privacy_type,
                          uint8_t device_name_char_len,
                          uint8_t identity_address_type,
                          uint16_t *service_handle,
                          uint16_t *dev_name_char_handle,
                          uint16_t *appearance_char_handle);
/**
  * @brief Send a slave security request to the master. This command has to be
  *        issued to notify the master of the security requirements of the slave.
  *        The master may encrypt the link, initiate the pairing procedure, or
  *        reject the request.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_slave_security_req(uint16_t connection_handle);
/**
  * @brief This command can be used to get the current security settings of the
  *        device.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param[out] security_mode Security mode.
  *             Values:
  *             - 0x01: Security Mode 1
  *             - 0x02: Security Mode 2
  * @param[out] security_level Security Level.
  *             Values:
  *             - 0x01: Security Level 1
  *             - 0x02: Security Level 2
  *             - 0x03: Security Level 3
  *             - 0x04: Security Level 4
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_get_security_level(uint16_t connection_handle,
                                        uint8_t *security_mode,
                                        uint8_t *security_level);
/**
  * @brief It allows masking events from the GAP. The default configuration is
  *        all the events masked.
  * @param gap_evt_mask GAP event mask. Default: 0xFFFF.
  *        Flags:
  *        - 0x0000: No events
  *        - 0x0001: ACI_GAP_LIMITED_DISCOVERABLE_EVENT
  *        - 0x0002: ACI_GAP_PAIRING_COMPLETE_EVENT
  *        - 0x0004: ACI_GAP_PASS_KEY_REQ_EVENT
  *        - 0x0008: ACI_GAP_AUTHORIZATION_REQ_EVENT
  *        - 0x0010: ACI_GAP_SLAVE_SECURITY_INITIATED_EVENT
  *        - 0x0020: ACI_GAP_BOND_LOST_EVENT
  *        - 0x0080: ACI_GAP_PROC_COMPLETE_EVENT
  *        - 0x0100: ACI_L2CAP_CONNECTION_UPDATE_REQ_EVENT
  *        - 0x0200: ACI_L2CAP_CONNECTION_UPDATE_RESP_EVENT
  *        - 0x0400: ACI_L2CAP_PROC_TIMEOUT_EVENT
  *        - 0x0800: ACI_GAP_ADDR_NOT_RESOLVED_EVENT
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_event_mask(uint16_t gap_evt_mask);
/**
  * @brief Command the controller to terminate the connection. A @ref
  *        hci_disconnection_complete_event event will be generated when the link
  *        is disconnected. It is important to leave an 100 ms blank window
  *        before sending any new command (including system hardware reset),
  *        since immediately after @ref hci_disconnection_complete_event event,
  *        system could save important information in non volatile memory.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param reason The reason for ending the connection.
  *        Values:
  *        - 0x05: Authentication Failure
  *        - 0x13: Remote User Terminated Connection
  *        - 0x14: Remote Device Terminated Connection due to Low Resources
  *        - 0x15: Remote Device Terminated Connection due to Power Off
  *        - 0x1A: Unsupported Remote Feature
  *        - 0x3B: Unacceptable Connection Parameters
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_terminate(uint16_t connection_handle,
                               uint8_t reason);
/**
  * @brief Clear the security database. All the devices in the security database
  *        will be removed. ATTENTION: It is strongly recommended not to give
  *        this command during intense radio activity (e.g. during advertising or
  *        connection with short intervals, i.e. less than 30 ms, or during
  *        scanning), since it will trigger an erase of a Flash sector. After
  *        this command, all devices previously recorded in the bonding table and
  *        connected when command has been submitted will remain connected,
  *        preserving authentication and encryption of the link.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_clear_security_db(void);
/**
  * @brief Allows the security manager to complete the pairing procedure and re-
  *        bond with the master. This command should be given by the application
  *        when it receives the ACI_GAP_BOND_LOST_EVENT if it wants the re-
  *        bonding to happen successfully. If this command is not given on
  *        receiving the event, the bonding procedure will timeout.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_allow_rebond(uint16_t connection_handle);
/**
  * @brief Creates a direct connection to a device.
  * @param initiating_phy PHYs that will be used for initiating the connection.
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param peer_address_type The peer_address_type parameter indicates the type
  *        of address used in the connectable advertisement sent by the peer. 0:
  *        Public Device Address or Public Identity Address 1: Random Device
  *        Address or Random (static) Identity Address
  *        Values:
  *        - 0x00: Public Address
  *        - 0x01: Random Address
  * @param peer_address Public Device Address, Random Device Address, Public
  *        Identity Address, or Random (static) Identity Address of the device to
  *        be connected.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_create_connection(uint8_t initiating_phy,
                                       uint8_t peer_address_type,
                                       uint8_t peer_address[6]);
/**
  * @brief Terminate the specified GAP procedure. An @ref
  *        aci_gap_proc_complete_event event is generated when the procedure has
  *        been completed, with the procedure code set to the corresponding
  *        procedure.
  * @param procedure_code Code identifying the procedure.
  *        Values:
  *        - 0x00: GAP_LIMITED_DISCOVERY_PROC
  *        - 0x01: GAP_GENERAL_DISCOVERY_PROC
  *        - 0x02: GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x03: GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x04: GAP_SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x05: GAP_OBSERVATION_PROC
  *        - 0x06: GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x07: GAP_NAME_DISCOVERY_PROC
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_terminate_proc(uint8_t procedure_code);
/**
  * @brief Start the connection update procedure (only when role is Master). A
  *        @ref hci_le_connection_update is called. On completion of the
  *        procedure, an @ref hci_le_connection_update_complete_event event is
  *        returned to the upper layer.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param conn_interval_min Minimum value for the connection event interval.
  *        This shall be less than or equal to conn_interval_max. Time = N * 1.25
  *        msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_interval_max Maximum value for the connection event interval.
  *        This shall be greater than or equal to conn_interval_min. Time = N *
  *        1.25 msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link. It shall be a
  *        multiple of 10 ms and larger than (1 + connSlaveLatency) *
  *        connInterval * 2. Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @param minimum_ce_length Information parameter about the minimum length of
  *        connection needed for this LE connection. Time = N * 0.625 msec.
  * @param maximum_ce_length Information parameter about the maximum length of
  *        connection needed for this LE connection. Time = N * 0.625 msec.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_start_connection_update(uint16_t connection_handle,
                                             uint16_t conn_interval_min,
                                             uint16_t conn_interval_max,
                                             uint16_t conn_latency,
                                             uint16_t supervision_timeout,
                                             uint16_t minimum_ce_length,
                                             uint16_t maximum_ce_length);
/**
  * @brief Send the SM pairing request to start a pairing process. The
  *        authentication requirements and IO capabilities should be set before
  *        issuing this command using the @ref aci_gap_set_io_capability and @ref
  *        aci_gap_set_authentication_requirement commands. A @ref
  *        aci_gap_pairing_complete_event event is returned after the pairing
  *        process is completed.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param force_rebond If 1, Pairing request will be sent even if the device was
  *        previously bonded,  otherwise pairing request is not sent.
  *        Values:
  *        - 0x00: NO
  *        - 0x01: YES
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_send_pairing_req(uint16_t connection_handle,
                                      uint8_t force_rebond);
/**
  * @brief This command tries to resolve the address provided with the IRKs
  *        present in its database. If the address is resolved successfully with
  *        any one of the IRKs present in the database, it returns success and
  *        also the corresponding public/static random address stored with the
  *        IRK in the database.
  * @param address Address to be resolved
  * @param[out] actual_address The public or static random address of the peer
  *             device, distributed during pairing phase.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_resolve_private_addr(uint8_t address[6],
                                          uint8_t actual_address[6]);
/**
  * @brief This command returns the identity addresses of the bonded devices.
  * @param offset Index of the first record to be returned.
  * @param max_num_of_addresses Used to specify the maximum number of devices to
  *        be returned.
  * @param[out] num_of_addresses The number of bonded devices returned by this
  *             command.
  * @param[out] bonded_device_entry See @ref bonded_device_entry_t
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_get_bonded_devices(uint8_t offset,
                                        uint8_t max_num_of_addresses,
                                        uint8_t *num_of_addresses,
                                        bonded_device_entry_t bonded_device_entry[]);
/**
  * @brief The command finds whether the device, whose address is specified in
  *        the command, is bonded. If the device is using a resolvable private
  *        address and it has been bonded, then the command will return
  *        BLE_STATUS_SUCCESS.
  * @param peer_address_type Address type.
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  * @param peer_address Address used by the peer device while advertising
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_is_device_bonded(uint8_t peer_address_type,
                                      uint8_t peer_address[6]);
/**
  * @brief This command allows the User to validate/confirm or not the Numeric
  *        Comparison value showed through the
  *        ACI_GAP_Numeric_Comparison_Value_Event.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param confirm_yes_no 0 : The Numeric Values showed on both local and peer
  *        device are different! 1 : The Numeric Values showed on both local and
  *        peer device are equal!
  *        Values:
  *        - 0x00: No
  *        - 0x01: YES
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_numeric_comparison_value_confirm_yesno(uint16_t connection_handle,
                                                            uint8_t confirm_yes_no);
/**
  * @brief This command permits to signal to the Stack the input type detected
  *        during Passkey input.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param input_type Passkey input type detected
  *        Values:
  *        - 0x00: Passkey entry started
  *        - 0x01: Passkey digit entered
  *        - 0x02: Passkey digit erased
  *        - 0x03: Passkey cleared
  *        - 0x04: Passkey entry completed
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_passkey_input(uint16_t connection_handle,
                                   uint8_t input_type);
/**
  * @brief This command is sent by the User to get (i.e. to extract from the
  *        Stack) the OOB data generated by the Stack itself. In a complete
  *        system (i.e. having an OOB channel fully handled) this command should
  *        be invoked by the OOB Channel manager to require the local OOB data
  *        (hence without user interaction) to be sent via OOB to the remote peer
  *        candidate device. The requested OOB data are returned in response to
  *        the incoming command. The OOB data are not generated on the fly, but
  *        they are already available in the Stack.
  * @param oob_data_type OOB Data type. - 0x00: Legacy Privacy (LP) v.4.1 TK
  *        (Temporary Key) - 0x01: Secure Connections (SC) v.4.2 Random value r
  *        used for generation of Confirm value - 0x02: Secure Connections (SC)
  *        v.4.2 Confirm value C generated through AES-CMAC-128 based
