zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_gap_aci.h
  *        cryptographic function: C=f4(PKx, PKx, r, 0)
  *        Values:
  *        - 0x00: SM_TK
  *        - 0x01: SM_RANDOM_VALUE
  *        - 0x02: SM_CONFIRM_VALUE
  * @param[out] address_type Identity address type.
  *             Values:
  *             - 0x00: Public Identity Address
  *             - 0x01: Random (static) Identity Address
  * @param[out] address Public or Random (static) address of this  device
  * @param[out] oob_data_len Length of OOB Data carried by next data field
  * @param[out] oob_data OOB Data to be exported via OOB.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_get_oob_data(uint8_t oob_data_type,
                                  uint8_t *address_type,
                                  uint8_t address[6],
                                  uint8_t *oob_data_len,
                                  uint8_t oob_data[16]);
/**
  * @brief This command is sent (by the User) to input the OOB data arrived via
  *        OOB communication. It may be sent to set either the OOB Authentication
  *        data of the Local device, or the data received via OOB by the Remote
  *        peer candidate device. It can be used with oob_data_len set to 0 to
  *        generate OOB authentication data for Secure Connections. In a complete
  *        system (i.e. having an OOB channel fully handled) this command should
  *        be invoked by the OOB Channel manager when receiving the OOB data
  *        (hence without user interaction). Since the BLE stack v 2.x
  *        implementation supports just one entry for the Remote peer candidate
  *        list containing the OOB data, at every command invocation the data
  *        existing in that entry are overwritten.
  * @param device_type OOB Device type:  - 0x00: The Address information are
  *        ignored.    - oob_data_len= 0x00: this triggers the automatic
  *        regeneration of OOB Authentication data (for Secure Connections only).
  *        - oob_data_len in [0..16]: the oob_data carried by the command will
  *        overwrite the current local Authentication OOB Data.  - 0x01: The
  *        Address information is used to search the entry of the Remote peer
  *        candidate list containing the OOB data for that specific remote
  *        device; if no entry exists, a new entry is used, if available (current
  *        implementation supports only 1 entry in this list).    - oob_data_len
  *        in [0..16]: the oob_data carried by the command overwrites (if
  *        present) the remote Authentication OOB Data.
  *        Values:
  *        - 0x00: Local device
  *        - 0x01: Remote device
  * @param address_type Identity address type.
  *        Values:
  *        - 0x00: Public Identity Address
  *        - 0x01: Random (static) Identity Address
  * @param address Public or Random (static) address of the peer device
  * @param oob_data_type OOB Data type. - 0x00: Legacy Privacy (LP) v.4.1 TK
  *        (Temporary Key) - 0x01: Secure Connections (SC) v.4.2 Random value r
  *        used for generation of Confirm value - 0x02: Secure Connections (SC)
  *        v.4.2 Confirm value C generated through AES-CMAC-128 based
  *        cryptographic function: C=f4(PKx, PKx, r, 0)
  *        Values:
  *        - 0x00: SM_TK
  *        - 0x01: SM_RANDOM_VALUE
  *        - 0x02: SM_CONFIRM_VALUE
  * @param oob_data_len Length of OOB Data carried by next data field
  *        Values:
  *        - 0x00 ... 0x10
  * @param oob_data OOB Data to be exported via OOB.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_oob_data(uint8_t device_type,
                                  uint8_t address_type,
                                  uint8_t address[6],
                                  uint8_t oob_data_type,
                                  uint8_t oob_data_len,
                                  uint8_t oob_data[16]);
/**
  * @brief This command can be used to remove a specified device from the bonding
  *        table. ATTENTION: the device removed from the Bonding Table will
  *        preserve its connection and authentication, until explicit
  *        disconnection is requested by the user.
  * @param peer_identity_address_type Identity address type.
  *        Values:
  *        - 0x00: Public Identity Address
  *        - 0x01: Random (static) Identity Address
  * @param peer_identity_address Public or Random (static) Identity address of
  *        the peer device
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_remove_bonded_device(uint8_t peer_identity_address_type,
                                          uint8_t peer_identity_address[6]);
/**
  * @brief This commands configures the advertising parameters for the legacy
  *        advertising or for a given extended advertising set.
  * @param advertising_handle Used to identify an advertising set. This parameter
  *        is only meaningful if Extended Advertising Feature is enabled.
  *        Values:
  *        - 0x00 ... 0xEF
  * @param discoverable_mode Specifies the discoverable mode of the device.
  *        Values:
  *        - 0: Not Discoverable
  *        - 1: Limited Discoverable
  *        - 2: General Discoverable
  *        - 3: Broadcast
  * @param advertising_event_properties The advertising_event_properties
  *        parameter describes the type of advertising event that is being
  *        configured and its basic properties according to V5.1, Vol 2, Part E,
  *        section 7.8.53.
  *        Flags:
  *        - 0x0001: Connectable
  *        - 0x0002: Scannable
  *        - 0x0004: Directed
  *        - 0x0008: High Duty Cycle Directed Connectable
  *        - 0x0010: Legacy
  *        - 0x0020: Anonymous
  *        - 0x0040: Include TX Power
  * @param primary_advertising_interval_min Minimum advertising interval for
  *        undirected and low duty cycle directed advertising. Time = N * 0.625
  *        msec.
  *        Values:
  *        - 0x00000020 (20.000 ms)  ... 0x00FFFFFF (10485759.375 ms)
  * @param primary_advertising_interval_max Maximum advertising interval for
  *        undirected and low duty cycle directed advertising. Time = N * 0.625
  *        msec.
  *        Values:
  *        - 0x00000020 (20.000 ms)  ... 0x00FFFFFF (10485759.375 ms)
  * @param primary_advertising_channel_map It is a bit field that indicates the
  *        advertising channels that shall be used when transmitting advertising
  *        packets.
  *        Flags:
  *        - 0x01: CH_37
  *        - 0x02: CH_38
  *        - 0x04: CH_39
  * @param peer_address_type The peer address type.
  *        Values:
  *        - 0x00: Public
  *        - 0x01: Random
  * @param peer_address Public Device Address, Random Device Address, Public
  *        Identity Address, or Random (static) Identity Address of the device to
  *        be connected.
  * @param advertising_filter_policy Advertising Filter Policy. If Directed
  *        advertising is selected, the peer_address_type and peer_address shall
  *        be valid and the advertising_filter_policy parameter shall be ignored.
  *        0x00 Process scan and connection requests from all devices (i.e., the
  *        White List is not in use) 0x01 Process connection requests from all
  *        devices and scan requests only from devices that are in the White List
  *        0x02 Process scan requests from all devices and connection requests
  *        only from devices that are in the White List. 0x03 Process scan and
  *        connection requests only from devices in the White List. All other
  *        values Reserved for future use
  *        Values:
  *        - 0x00: Scan and Connection requests from any
  *        - 0x01: Connection requests from any, scan requests from White List only
  *        - 0x02: Scan requests from any, connection requests from White List only
  *        - 0x03: Scan and connection requests from White
List only
  * @param advertising_tx_power The advertising_tx_power parameter indicates the
  *        maximum power level at which the advertising packets are to be
  *        transmitted on the advertising channels. The Controller shall choose a
  *        power level lower than or equal to the one specified by the Host.
  *        (Units: dBm). This parameter is ignored if extended advertising is not
  *        enabled.
  *        Values:
  *        - -127 ... 126
  *        - 127: No preference
  * @param primary_advertising_phy The primary_advertising_phy parameter
  *        indicates the PHY on which the advertising packets are transmitted on
  *        the primary advertising channel. If legacy advertising PDUs are being
  *        used, the primary_advertising_phy shall indicate the LE 1M PHY. This
  *        parameter is ignored if extended advertising is not enabled.
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x03: LE_CODED_PHY
  * @param secondary_advertising_max_skip The secondary_advertising_max_skip
  *        parameter is the maximum number of advertising events that can be
  *        skipped before the AUX_ADV_IND can be sent. This parameter is ignored
  *        if extended advertising is not enabled. 0x00 AUX_ADV_IND shall be sent
  *        prior to the next advertising event 0x01-0xFF Maximum advertising
  *        events the Controller can skip before sending the AUX_ADV_IND packets
  *        on the secondary advertising channel
  * @param secondary_advertising_phy The secondary_advertising_phy parameter
  *        indicates the PHY on which the advertising packets are be transmitted
  *        on the secondary advertising channel. This parameter is ignored if
  *        extended advertising is not enabled.
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY
  * @param advertising_sid The advertising_sid parameter specifies the value to
  *        be transmitted in the Advertising SID subfield of the ADI field of the
  *        Extended Header of those advertising channel PDUs that have an ADI
  *        field. If the advertising set only uses PDUs that do not contain an
  *        ADI field, advertising_sid is ignored. This parameter is ignored if
  *        extended advertising is not enabled.
  *        Values:
  *        - 0x00 ... 0x0F
  * @param scan_request_notification_enable The scan_request_notification_enable
  *        parameter indicates whether the Controller shall send notifications
  *        upon the receipt of a scan request PDU that is in response to an
  *        advertisement from the specified advertising set that contains its
  *        device address and is from a scanner that is allowed by the
  *        advertising filter policy. This parameter is ignored if extended
  *        advertising is not enabled.
  *        Values:
  *        - 0x00: Scan request notifications disabled
  *        - 0x01: Scan request notifications enabled
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_advertising_configuration(uint8_t advertising_handle,
                                                   uint8_t discoverable_mode,
                                                   uint16_t advertising_event_properties,
                                                   uint32_t primary_advertising_interval_min,
                                                   uint32_t primary_advertising_interval_max,
                                                   uint8_t primary_advertising_channel_map,
                                                   uint8_t peer_address_type,
                                                   uint8_t peer_address[6],
                                                   uint8_t advertising_filter_policy,
                                                   int8_t advertising_tx_power,
                                                   uint8_t primary_advertising_phy,
                                                   uint8_t secondary_advertising_max_skip,
                                                   uint8_t secondary_advertising_phy,
                                                   uint8_t advertising_sid,
                                                   uint8_t scan_request_notification_enable);
/**
  * @brief The LE_Set_Extended_Advertising_Enable command is used to request the
  *        Controller to enable or disable one or more advertising sets using the
  *        advertising sets identified by the advertising_handle[i] parameter.
  *        The Controller manages the timing of advertisements in accordance with
  *        the advertising parameters given in the
  *        LE_Set_Extended_Advertising_Parameters command. Only Enable parameter
  *        is used if extended advertising feature is disabled through modular
  *        configuration (CONTROLLER_EXT_ADV_SCAN_ENABLED=0).
  * @param Enable It allows to enable or disable one or more advertising sets
  *        using the advertising sets identified by the advertising_handle[i]
  *        parameter.
  *        Values:
  *        - 0x00: Disable
  *        - 0x01: Enable
  * @param number_of_sets The number_of_sets parameter is the number of
  *        advertising sets contained in the parameter arrays. 0x00: Disable all
  *        advertising sets 0x01 to 0x3F: Number of advertising sets to enable or
  *        disable. Ignored if extended advertising feature is disabled through
  *        modular configuration (CONTROLLER_EXT_ADV_SCAN_ENABLED=0).
  *        Values:
  *        - 0x00: Disable all sets
  *        - 0x01 ... 0x3F
  * @param advertising_set_parameters See @ref advertising_set_parameters_t
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_advertising_enable(uint8_t enable,
                                            uint8_t number_of_sets,
                                            advertising_set_parameters_t advertising_set_parameters[]);
/**
  * @brief The ACI_GAP_SET_ADVERTISING_DATA_NWK function is used to set the data
  *        in advertising PDUs.  If the device is in Limited Discoverable Mode,
  *        Flags data type in advertising data must have the flags set as
  *        described: - The LE Limited Discoverable Mode flag set to one. - The
  *        'BR/EDR Not Supported' flag set to one. - All other flags set to zero.
  *        If the device is in General Discoverable Mode, Flags data type in
  *        advertising data must have the flags set as described: - The LE
  *        General Discoverable Mode flag set to one. - The 'BR/EDR Not
  *        Supported' flag set to one. - All other flags set to zero.  If the
  *        device is in one of the other modes, Flags data type in advertising
  *        data must have the flags set as described: - The 'BR/EDR Not
  *        Supported' flag set to one. - All other flags set to zero.  If a
  *        device is sending non connectable events, Flags data type may be
  *        omitted, otherwise it must be present.
  * @param advertising_handle Used to identify an advertising set. This parameter
  *        is only meaningful if Extended Advertising Feature is enabled.
  *        Values:
  *        - 0x00 ... 0xEF
  * @param operation The Host may set the advertising data in one or more
  *        operations using this parameter. 0x00: Intermediate fragment of
  *        fragmented extended advertising data 0x01: First fragment of
  *        fragmented extended advertising data 0x02: Last fragment of fragmented
  *        extended advertising data 0x03: Complete extended advertising data
  *        0x04: Unchanged data (just update the Advertising DID) All other
  *        values: Reserved for future use
  *        Values:
  *        - 0x00: Intermediate fragment
  *        - 0x01: First fragment
  *        - 0x02: Last fragment
  *        - 0x03: Complete data
  *        - 0x04: Unchanged data
  * @param advertising_data_length Length of advertising data. For legacy PDUs
  *        which supports advertising data maximum value is 31 octets.
  *        Values:
  *        - 0 ... 251
  * @param advertising_data Advertising data, that must be properly formatted
  *        (see Core v5.1 Vol 3, part C, chapter 11).
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_advertising_data_nwk(uint8_t advertising_handle,
                                              uint8_t operation,
                                              uint8_t advertising_data_length,
                                              uint8_t advertising_data[]);
/**
  * @brief The ACI_GAP_SET_SCAN_RESPONSE_DATA function configures the scan
  *        response data as requested by the application.
  * @param advertising_handle Used to identify an advertising set. This parameter
  *        is only meaningful if Extended Advertising Feature is enabled.
  *        Values:
  *        - 0x00 ... 0xEF
  * @param operation The Host may set the scan response data in one or more
  *        operations using the operation parameter in the command. 0x00:
  *        Intermediate fragment of fragmented scan response data 0x01: First
  *        fragment of fragmented scan response data 0x02: Last fragment of
  *        fragmented scan response data 0x03: Complete scan response data All
  *        other values: Reserved for future use
  *        Values:
  *        - 0x00: Intermediate fragment
  *        - 0x01: First fragment
  *        - 0x02: Last fragment
  *        - 0x03: Complete data
  * @param scan_response_data_length Length of scan response data. If the
  *        advertising set uses scannable legacy advertising PDUs maximum length
  *        is 31 octets.
  *        Values:
  *        - 0 ... 251
  * @param scan_response_data Scan response data, that must be properly formatted
  *        (see Core v5.1 Vol 3, part C, chapter 11).
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_scan_response_data_nwk(uint8_t advertising_handle,
                                                uint8_t operation,
                                                uint8_t scan_response_data_length,
                                                uint8_t scan_response_data[]);
/**
  * @brief The ACI_GAP_SET_SCAN_CONFIGURATION function configures the scan
  *        parameters for a given PHY. To configure more than one PHY, this
  *        function must be called more times.
  * @param filter_duplicates The filter_duplicates parameter controls whether the
  *        Link Layer should filter out duplicate advertising reports (filtering
  *        duplicates enabled) to the Host or if the Link Layer should generate
  *        advertising reports for each packet received (filtering duplicates
  *        disabled). See [Vol 6] Part B, Section 4.4.3.5.
  *        Values:
  *        - 0x00: Duplicate filtering disabled
  *        - 0x01: Duplicate filtering enabled
  *        - 0x02: Duplicate filtering enabled, reset for each scan period
  * @param scanning_filter_policy 0x00 Accept all advertisement packets. Directed
  *        advertising packets which are not addressed for this device shall be
  *        ignored. 0x01 Ignore advertisement packets from devices not in the
  *        White List Only. Directed advertising packets which are not addressed
  *        for this device shall be ignored 0x02 Accept all undirected
  *        advertisement packets. Directed advertisement packets where initiator
  *        address is a RPA and  Directed advertisement packets addressed to this
  *        device shall be accepted. 0x03 Accept all undirected advertisement
  *        packets from devices that are in the White List.Directed advertisement
  *        packets where initiator address is RPA and Directed advertisement
  *        packets addressed to this device shall be accepted.
  *        Values:
  *        - 0x00: Accept All
  *        - 0x01: White List Only
  *        - 0x02: Accept All (use resolving list)
  *        - 0x03: White List Only (use resolving list)
  * @param Scanning_PHY PHY that is going to be configured. Only one bit can be
  *        set.
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param scan_type The scan_type parameter specifies the type of scan to
  *        perform. 0: Passive Scanning. No scan request PDUs shall be sent. 1:
  *        Active Scanning. Scan request PDUs may be sent.
  *        Values:
  *        - 0x00: Passive Scanning
  *        - 0x01: Active Scanning
  * @param scan_interval Time interval from when the Controller started its last
  *        scan until it begins the subsequent scan on the primary advertising
  *        physical channel.  Time = N * 0.625 ms
  *        Values:
  *        - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms)
  * @param scan_window Time interval from when the Controller started its last
  *        scan until it begins the subsequent scan on the primary advertising
  *        physical channel. Time = N * 0.625 msec.
  *        Values:
  *        - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms)
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_scan_configuration(uint8_t filter_duplicates,
                                            uint8_t scanning_filter_policy,
                                            uint8_t Scanning_PHY,
                                            uint8_t scan_type,
                                            uint16_t scan_interval,
                                            uint16_t scan_window);
/**
  * @brief This function configures the connection parameters. To configure more
  *        than one PHY, this function must be called more times.
  * @param initiating_phy PHY that is going to be configured. Only one bit can be
  *        set.
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x02: LE_2M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param conn_interval_min Minimum value for the connection event interval.
  *        This shall be less than or equal to conn_interval_max. Time = N * 1.25
  *        msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_interval_max Maximum value for the connection event interval.
  *        This shall be greater than or equal to conn_interval_min. Time = N *
  *        1.25 msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link. It shall be a
  *        multiple of 10 ms and larger than (1 + connSlaveLatency) *
  *        connInterval * 2. Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @param minimum_ce_length Information parameter about the minimum length of
  *        connection needed for this LE connection. Time = N * 0.625 msec.
  * @param maximum_ce_length Information parameter about the maximum length of
  *        connection needed for this LE connection. Time = N * 0.625 msec.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_connection_configuration(uint8_t initiating_phy,
                                                  uint16_t conn_interval_min,
                                                  uint16_t conn_interval_max,
                                                  uint16_t conn_latency,
                                                  uint16_t supervision_timeout,
                                                  uint16_t minimum_ce_length,
                                                  uint16_t maximum_ce_length);
/**
  * @brief Starts a GAP procedure according to the procedure code.
  * @param procedure_code Procedure to be started.
  *        Values:
