zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_gap_aci.h
  *        - 0x00: GAP_LIMITED_DISCOVERY_PROC
  *        - 0x01: GAP_GENERAL_DISCOVERY_PROC
  *        - 0x02: GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x03: GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x04: GAP_SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x05: GAP_OBSERVATION_PROC
  * @param phy_s PHYs that will be used for Scanning or Initiating .
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param duration Ignored. Reserved for future use.
  * @param period Ignored. Reserved for future use.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_start_procedure(uint8_t procedure_code,
                                     uint8_t phy_s,
                                     uint16_t duration,
                                     uint16_t period);
/**
  * @brief Creates a direct connection to a device and read the name
  *        characteristic.
  * @param phy_s PHYs that will be used for initiating the connection.
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param peer_address_type The peer_address_type parameter indicates the type
  *        of address used in the connectable advertisement sent by the peer. 0:
  *        Public Device Address or Public Identity Address 1: Random Device
  *        Address or Random (static) Identity Address
  *        Values:
  *        - 0x00: Public Address
  *        - 0x01: Random Address
  * @param peer_address Public Device Address, Random Device Address, Public
  *        Identity Address, or Random (static) Identity Address of the device to
  *        be connected.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_discover_name(uint8_t phy_s,
                                   uint8_t peer_address_type,
                                   uint8_t peer_address[6]);
/**
  * @brief Add specific device addresses to the white and/or resolving list.
  * @param lists Select in which list the device addresses will be added: white
  *        list, resolving list or both.
  *        Flags:
  *        - 0x01: White List
  *        - 0x02: Resolving List
  * @param clear_lists Clear the selected lists before adding the device
  *        addresses.
  *        Values:
  *        - 0x00: Do not clear
  *        - 0x01: Clear before adding
  * @param num_of_list_entries Number of devices that have to be added to the
  *        whitelist.
  *        Values:
  *        - 0x00 ... 0xFF
  * @param list_entry See @ref list_entry_t
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_add_devices_to_white_and_resolving_list(uint8_t lists,
                                                             uint8_t clear_lists,
                                                             uint8_t num_of_list_entries,
                                                             list_entry_t list_entry[]);
/**
  * @brief Clear the specified lists and add all bonded devices.
  * @param lists Select in which list the device addresses will be added: white
  *        list, resolving list or both.
  *        Flags:
  *        - 0x01: White List
  *        - 0x02: Resolving List
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_configure_white_and_resolving_list(uint8_t lists);
/**
  * @brief The GAP_Set_Periodic_Advertising_Configuration command is used by the
  *        Host to set the parameters for periodic advertising. See
  *        hci_le_set_periodic_advertising_parameters().
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify a periodic advertisement
  * @param periodic_advertising_interval_min Minimum advertising interval for
  *        periodic advertising. Time = N * 1.25 ms; Time Range: 7.5ms to
  *        81.91875 s.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) : Minimum advertising interval for periodic advertising.
  * @param periodic_advertising_interval_max Maximum advertising interval for
  *        periodic advertising. Time = N * 1.25 ms; Time Range: 7.5ms to
  *        81.91875 s.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) : Maximum advertising interval for periodic advertising.
  * @param periodic_advertising_properties The periodic_advertising_properties
  *        parameter indicates which fields should be included in the advertising
  *        packet.
  *        Flags:
  *        - 0x0040: Include TxPower in the advertising PDU
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_periodic_advertising_configuration(uint8_t advertising_handle,
                                                            uint16_t periodic_advertising_interval_min,
                                                            uint16_t periodic_advertising_interval_max,
                                                            uint16_t periodic_advertising_properties);
/**
  * @brief The GAP_Set_Periodic_Advertising_Data command is used to set the data
  *        used in periodic advertising PDUs. See
  *        hci_le_set_periodic_advertising_data().
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify an advertising set
  * @param operation The Host may set the periodic advertising data in one or
  *        more operations using the operation parameter in the command.
  *        Values:
  *        - 0x00: Intermediate fragment of fragmented periodic advertising data
  *        - 0x01: First fragment of fragmented periodic advertising data
  *        - 0x02: Last fragment of fragmented periodic advertising data
  *        - 0x03: Complete periodic advertising data
  * @param advertising_data_length The number of octets in the Advertising Data
  *        parameter
  *        Values:
  *        - 0 ... 252: The number of octets in the Advertising Data parameter
  * @param advertising_data Periodic advertising data formatted as defined in
  *        [Vol 3] Part C, Section 11. Note: This parameter has a variable
  *        length.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_periodic_advertising_data_nwk(uint8_t advertising_handle,
                                                       uint8_t operation,
                                                       uint8_t advertising_data_length,
                                                       uint8_t advertising_data[]);
/**
  * @brief The GAP_Set_Periodic_Advertising_Enable command is used to request the
  *        Controller to enable or disable the periodic advertising for the
  *        advertising set specified by the advertising_handle parameter
  *        (ordinary advertising is not affected). See
  *        hci_le_set_periodic_advertising_enable().
  * @param enable It is used to request the Controller to enable or disable the
  *        periodic advertising for the advertising set specified by the
  *        advertising_handle parameter (ordinary advertising is not affected).
  *        Values:
  *        - 0x00: Periodic advertising is disabled (default)
  *        - 0x01: Periodic advertising is enabled
  * @param advertising_handle
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify an advertising set
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_periodic_advertising_enable(uint8_t enable,
                                                     uint8_t advertising_handle);
/**
  * @brief The GAP_Periodic_Advertising_Create_Sync command is used to
  *        synchronize with periodic advertising from an advertiser and begin
  *        receiving periodic advertising packets. See
  *        hci_le_periodic_advertising_create_sync().
  * @param options The options parameter is used to determine whether the
  *        Periodic Advertiser List is used and whether
  *        HCI_Periodic_Advertising_Report events for this periodic advertising
  *        train are initially enabled or disabled. If bit 0 is set, the Periodic
  *        Advertiser List is used to determine which advertiser to listen to. If
  *        the Periodic Advertiser List is not used, the advertising_sid,
  *        Advertiser address_type, and Advertiser Address parameters specify the
  *        periodic advertising device to listen to; otherwise they shall be
  *        ignored. If bit 1 is set, reporting is initially disabled, otherwise
  *        it is enabled.
  *        Flags:
  *        - 0x01: USE_PERIODIC_ADV_LIST
  *        - 0x02: DISABLE_REPORTING
  * @param advertising_sid The advertising_sid parameter, if used, specifies the
  *        value that must match the Advertising SID subfield in the ADI field of
  *        the received advertisement for it to be used to synchronize.
  *        Values:
  *        - 0x00 ... 0x0F: Advertising SID subfield in the ADI field used to identify the Periodic
  *          Advertising
  * @param advertising_address_type Advertising address type
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param skip The Skip parameter specifies the number of consecutive periodic
  *        advertising packets that the receiver may skip after successfully
  *        receiving a periodic advertising packet.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param sync_timeout The Skip parameter specifies the number of consecutive
  *        periodic advertising packets that the receiver may skip after
  *        successfully receiving a periodic advertising packet. Time = N*10 ms;
  *        Time Range: 100 ms to 163.84 s.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x4000 (163840 ms) : Synchronization timeout for the periodic advertising
  * @param sync_cte_type The sync_cte_type parameter specifies whether to only
  *        synchronize to periodic advertising with certain types of Constant
  *        Tone Extension (a value of 0 indicates that the presence or absence of
  *        a Constant Tone Extension is irrelevant). If the periodic advertising
  *        has the wrong type of Constant Tone Extension then: - If bit 0 of
  *        options is set, the Controller shall ignore this address and SID and
  *        continue to search for other periodic advertisements. - Otherwise, the
  *        Controller shall cancel the synchronization with the error code
  *        Unsupported Remote Feature/Unsupported LMP Feature (0x1A).
  *        Flags:
  *        - 0x01: Do not sync to packets with an AoA Constant Tone Extension
  *        - 0x02: Do not sync to packets with an AoD Constant Tone Extension with 1 microsecond
  *          slots
  *        - 0x04: Do not sync to packets with an AoD Constant Tone Extension with 2 microseconds
  *          slots
  *        - 0x08: Do not sync to packets with a type 3 Constant Tone Extension (currently
  *          reserved for future use)
  *        - 0x10: Do not sync to packets without a Constant Tone Extension
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_periodic_advertising_create_sync(uint8_t options,
                                                      uint8_t advertising_sid,
                                                      uint8_t advertising_address_type,
                                                      uint8_t advertising_address[6],
                                                      uint16_t skip,
                                                      uint16_t sync_timeout,
                                                      uint8_t sync_cte_type);
/**
  * @brief The GAP_Periodic_Advertising_Create_Sync_Cancel command is used to
  *        cancel the GAP_Periodic_Advertising_Create_Sync command while it is
  *        pending. See hci_le_periodic_advertising_create_sync_cancel().
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_periodic_advertising_create_sync_cancel(void);
/**
  * @brief The GAP_Remove_Advertising_Set command is used to remove an
  *        advertising set from the Controller. If the advertising set
  *        corresponding to the advertising_handle parameter does not exist, then
  *        the Controller shall return the error code Unknown Advertising
  *        Identifier (0x42). If advertising on the advertising set is enabled,
  *        then the Controller shall return the error code Command Disallowed
  *        (0x0C).
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify an advertising set
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_remove_advertising_set(uint8_t advertising_handle);
/**
  * @brief The GAP_Clear_Advertising_Sets command is used to remove all existing
  *        advertising sets from the Controller. If advertising is enabled on any
  *        advertising set, then the Controller shall return the error code
  *        Command Disallowed (0x0C). Note: All advertising sets are cleared on
  *        HCI reset.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_clear_advertising_sets(void);
/**
  * @brief The GAP_Periodic_Advertising_Terminate_Sync command is used to stop
  *        reception of the periodic advertising identified by the sync_handle
  *        parameter. See hci_le_periodic_advertising_terminate_sync().
  * @param sync_handle It is used to identify the periodic advertiser
  *        Values:
  *        - 0x0000 ... 0x0EFF: sync_handle to be used to identify the periodic advertiser
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_periodic_advertising_terminate_sync(uint16_t sync_handle);
/**
  * @brief The GAP_Add_Device_To_Periodic_Advertiser_List command is used to add
  *        a single device to the Periodic Advertiser list stored in the
  *        Controller. See hci_le_add_device_to_periodic_advertiser_list().
  * @param advertiser_address_type Advertiser Address Type
  *        Values:
  *        - 0x00: Public Device Address or Public Identity Address
  *        - 0x01: Random Device Address or Random (static) Identity Address
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param advertising_sid Advertising SID subfield in the ADI field used to
  *        identify the Periodic Advertising
  *        Values:
  *        - 0x00 ... 0x0F: Advertising SID subfield in the ADI field used to identify the Periodic
Advertising
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_add_device_to_periodic_advertiser_list(uint8_t advertiser_address_type,
                                                            uint8_t advertising_address[6],
                                                            uint8_t advertising_sid);
/**
  * @brief The GAP_Remove_Device_From_Periodic_Advertiser_List command is used to
  *        remove one device from the list of Periodic Advertisers stored in the
  *        Controller. See hci_le_remove_device_from_periodic_advertising_list().
  * @param advertiser_address_type Advertising Address type
  *        Values:
  *        - 0x00: Public Device Address or Public Identity Address
  *        - 0x01: Random Device Address or Random (static) Identity Address
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param advertising_sid It is used to  identify the Periodic Advertising
  *        Values:
  *        - 0x00 ... 0x0F: Advertising SID subfield in the ADI field used to identify the Periodic
  *        Advertising
  *        All other values Reserved for future
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_remove_device_from_periodic_advertising_list(uint8_t advertiser_address_type,
                                                                  uint8_t advertising_address[6],
                                                                  uint8_t advertising_sid);
/**
  * @brief The GAP_Clear_Periodic_Advertiser_List command is used to remove all
  *        devices from the list of Periodic Advertisers in the Controller. See
  *        hci_le_clear_periodic_advertiser_list().
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_clear_periodic_advertiser_list(void);
/**
  * @brief The GAP_Read_Periodic_Advertiser_List_Size command is used to read the
  *        total number of Periodic Advertiser list entries that can be stored in
  *        the Controller. Note: The number of entries that can be stored is not
  *        fixed and the Controller can change it at any time (e.g., because the
  *        memory used to store the list can also be used for other purposes).
  * @param[out] periodic_advertiser_list_size Total number of Periodic Advertiser
  *             list entries that can be stored in the Controller
  *             Values:
  *             - 0x1F ... 0xFF: Total number of Periodic Advertiser list entries that can be stored in the
  *               Controller
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_read_periodic_advertiser_list_size(uint8_t *periodic_advertiser_list_size);
/**
  * @brief The ACI_GAP_Set_Periodic_Advertising_Receive_Enable command will
  *        enable or disable reports for the periodic advertising train
  *        identified by the sync_handle parameter. See
  *        hci_le_set_periodic_advertising_receive_enable().
  * @param sync_handle sync_handle identifying the periodic advertising train
  *        Values:
  *        - 0x0000 ... 0x0EFF: sync_handle identifying the periodic advertising train
  * @param enable It determines whether reporting is enabled or disabled
  *        Values:
  *        - 0x00: Reporting disabled
  *        - 0x01: Reporting enabled
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_periodic_advertising_receive_enable(uint16_t sync_handle,
                                                             uint8_t enable);
/**
  * @brief The ACI_GAP_Periodic_Advertising_Sync_Transfer command is used to
  *        instruct the Controller to send synchronization information about the
  *        periodic advertising train identified by the sync_handle parameter to
  *        a connected device. See hci_le_periodic_advertising_sync_transfer().
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param service_data The service_data parameter is a value provided by the
  *        Host for use by the Host of the peer device. It is not used by the
  *        Controller.
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_periodic_advertising_sync_transfer(uint16_t connection_handle,
                                                        uint16_t service_data,
                                                        uint16_t sync_handle);
/**
  * @brief The ACI_GAP_Periodic_Advertising_Set_Info_Transfer command is used to
  *        instruct the Controller to send synchronization information about the
  *        periodic advertising in an advertising set to a connected device. See
  *        hci_le_periodic_advertising_set_info_transfer()
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param service_data It is a value provided by the Host to identify the
  *        periodic advertising train to the peer device. It is not used by the
  *        Controller.
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_periodic_advertising_set_info_transfer(uint16_t connection_handle,
                                                            uint16_t service_data,
                                                            uint8_t advertising_handle);
/**
  * @brief The ACI_GAP_Set_Periodic_Advertising_Sync_Transfer_Parameters command
  *        is used to specify how the Controller will process periodic
  *        advertising synchronization information received from the device
  *        identified by the connection_handle parameter (the "transfer mode").
  *        See hci_le_set_periodic_advertising_sync_transfer_parameters().
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param mode The Mode parameter specifies the action to be taken when periodic
  *        advertising synchronization information is received. If Mode is 0x00,
  *        the Controller will ignore the information. Otherwise it will notify
  *        the Host and synchronize to the periodic advertising. Mode also
  *        specifies whether periodic advertising reports are initially enabled
  *        or disabled.
  *        Values:
  *        - 0x00: No attempt is made to synchronize to the periodic advertising and
  *                no HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *        - 0x01: An HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *                HCI_LE_Periodic_Advertising_Report events will be disabled.
  *        - 0x02: An HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *                HCI_LE_Periodic_Advertising_Report events will be enabled.
  * @param skip The Skip parameter specifies the number of consecutive periodic
  *        advertising packets that the receiver may skip after successfully
  *        receiving a periodic advertising packet.
  *        Values:
  *        - 0x0000 ... 0x01F3: The number of periodic advertising packets that can be skipped after
  *                             a successful receive
  * @param sync_timeout The Skip parameter specifies the number of consecutive
  *        periodic advertising packets that the receiver may skip after
  *        successfully receiving a periodic advertising packet. Time = N*10 ms;
  *        Time Range: 100 ms to 163.84 s.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x4000 (163840 ms) : Synchronization timeout for the periodic advertising
  * @param cte_type It specifies whether to only synchronize to periodic
  *        advertising with certain types of Constant Tone Extension. If the
  *        periodic advertiser changes the type of the Constant Tone Extension
  *        after the Controller has synchronized with the periodic advertising,
  *        it shall remain synchronized.
  *        Flags:
  *        - 0x01: Do not sync to packets with an AoA Constant Tone Extension
  *        - 0x02: Do not sync to packets with an AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x04: Do not sync to packets with an AoD Constant Tone Extension with 2 microseconds slots
  *        - 0x10: Do not sync to packets without a Constant Tone Extension
  * @retval Value indicating success or error code.
  */
ble_status_t aci_gap_set_periodic_advertising_sync_transfer_parameters(uint16_t connection_handle,
                                                                       uint8_t mode,
